blog/content-org/all-posts.org
#+hugo_base_dir: ../
#+author: visd0m

* how to blogpost directly from emacs :@emacs:
:PROPERTIES:
:EXPORT_FILE_NAME: how-to-blogpost-directly-from-emacs
:END:

** Why even do that?
If you like emacs and you are an emacs user at a certain point you will reach that moment when you try to do as much as you can directly from emacs.
No objective explanation on why this happens, but I give you my personal view on it.

I say that this what happens.
One start using a version of emacs that is far from being the perfect version of emacs for him.

Using it day by day you start customizing it and extending it making it fit your workflows and your needs.
This create a positive loop of
"I am not able to do X with emacs"
"I have fun customizing emacs in order to do X with emacs"
"I end up having a good enough workflow of doing X in emacs"
"I get used of doing X in emacs"

Replace X with blogposting and you have your answer.

** Which static site generator?
